import plotly.graph_objs as go

# Дані для діаграми розсіювання ВВП та кількості населення для країн ЄС у 2020 році
countries = ['Austria', 'Belgium', 'Bulgaria', 'Croatia', 'Cyprus', 'Czech Republic', 'Denmark', 'Estonia', 'Finland', 'France', 'Germany', 'Greece', 'Hungary', 'Ireland', 'Italy', 'Latvia', 'Lithuania', 'Luxembourg', 'Malta', 'Netherlands', 'Poland', 'Portugal', 'Romania', 'Slovakia', 'Slovenia', 'Spain', 'Sweden']
gdp = [446315, 519035, 648227, 649560, 289702, 2446046, 568097, 319571, 268099, 2689961, 4389415, 203928, 162164, 401937, 1997599, 349552, 535751, 69497, 127083, 985028, 1453396, 239767, 506671, 297489, 260815, 1537744, 528304]
population = [9006400, 11589623, 6951482, 4047200, 1207359, 10649800, 5818553, 1326535, 5540720, 65273511, 83783942, 10423054, 9660351, 4937796, 60367488, 1886198, 2722289, 625978, 441543, 17134872, 37846611, 10196707, 10196707, 5459642, 2078654, 47332614, 10379295]

# Дані для діаграми розсіювання ВВП на душу населення та середньої тривалості життя для країн ЄС у 2020 році
gdp_per_capita = [49553, 44882, 9318, 17566, 24167, 23077, 46283, 24154, 48468, 31943, 52603, 19279, 15540, 67388, 33294, 18603, 19626, 109633, 28739, 57803, 28633, 23484, 13039, 18461, 27001, 29570, 54039]
life_expectancy = [81.3, 81.1, 75.4, 78.7, 82.5, 79.2, 81.6, 78.3, 82.4, 82.7, 81.2, 81.4, 76.6, 82.4, 83.6, 75.1, 75.7, 82.1, 83.5, 82.3, 77.5, 81.4, 76.7, 76.7, 80.1, 83.4, 82.3]

# Дані для діаграми розсіювання ВВП на душу населення та витрат на охорону здоров’я для країн ЄС у 2020 році
healthcare_spending = [5531, 5056, 1032, 1572, 2658, 2466, 5514, 1497, 3577, 3952, 5709, 2024, 1652, 7191, 3562, 1312, 1398, 6677, 2432, 5205, 2168, 1782, 1025, 1452, 2102, 3496, 5534]

# Побудова першої діаграми розсіювання: ВВП та кількість населення
fig1 = go.Figure()
fig1.add_trace(go.Scatter(x=gdp, y=population, mode='markers', text=countries, marker=dict(color='blue', size=10, opacity=0.5)))
fig1.update_layout(title='Залежність між ВВП та кількістю населення для країн ЄС у 2020 році',
                   xaxis_title='ВВП (в млн євро)',
                   yaxis_title='Населення',
                   showlegend=False,
                   plot_bgcolor='rgba(0,0,0,0)')
fig1.show()

# Побудова другої діаграми розсіювання: ВВП на душу населення та середня тривалість життя
fig2 = go.Figure()
fig2.add_trace(go.Scatter(x=gdp_per_capita, y=life_expectancy, mode='markers', text=countries, 
                          marker=dict(color=healthcare_spending, size=10, opacity=0.5, colorscale='viridis', colorbar=dict(title='Витрати на охорону здоров’я (в євро)'))))
fig2.update_layout(title='Залежність між ВВП на душу населення та середньою тривалістю життя для країн ЄС у 2020 році',
                   xaxis_title='ВВП на душу населення (в євро)',
                   yaxis_title='Середня тривалість життя',
                   showlegend=False,
                   plot_bgcolor='rgba(0,0,0,0)')
fig2.show()
