# Створення словника з кількістю елементів не менше 5-ти
my_dict = {'key1': 10, 'key2': 20, 'key3': 30, 'key4': 40, 'key5': 50}

# Виведення початкового стану словника
print("Початковий словник:", my_dict)

# a) Поміняти місцями перший та останній елементи
# Отримуємо перший та останній ключі словника
first_key, last_key = list(my_dict.keys())[0], list(my_dict.keys())[-1]
# Помічаємо значення першого ключа у останній ключ, і навпаки
my_dict[last_key], my_dict[first_key] = my_dict[first_key], my_dict[last_key]
# Виведення словника після зміни місцями перших та останніх елементів
print("Словник після зміни місцями перших та останніх елементів:", my_dict)

# b) Видалити другий елемент
# Видаляємо другий елемент, використовуючи його індекс у списку ключів
del_key = list(my_dict.keys())[1]
del my_dict[del_key]
# Виведення словника після видалення другого елемента
print("Словник після видалення другого елемента:", my_dict)

# c) Додати до кінця ключ «new_key» зі значенням «new_value»
# Додаємо новий ключ зі значенням до словника
my_dict['new_key'] = 'new_value'
# Виведення словника після додавання нового ключа зі значенням
print("Словник після додавання нового ключа зі значенням:", my_dict)

# d) Вивести в окремі списки ключі та значення
# Створюємо окремий список ключів
keys_list = list(my_dict.keys())
# Створюємо окремий список значень
values_list = list(my_dict.values())
# Виведення списків ключів та значень
print("Список ключів:", keys_list)
print("Список значень:", values_list)
