# Заданий список
lst_1 = [5, 4, 3, 8, 2, 9, 6, 9, 1, 5, 4, 1, 2, 5, 7, 1, 3, 7, 5, 9, 3]

# a) Порахувати, скільки разів у ньому зустрічається кожне число
# Створюємо порожній словник для зберігання кількості входжень кожного числа
counts = {}
# Проходимося по елементах списку і додаємо їх до словника
for num in lst_1:
    if num in counts:
        counts[num] += 1
    else:
        counts[num] = 1
# Виводимо результат
print("a) Кількість входжень кожного числа:", counts)

# b) Створити словник, в якому ключами є унікальні елементи списку, а значеннями – кількість входжень цих елементів у список
# Використовуємо генератор словників для створення словника, де ключами є унікальні числа зі списку, а значеннями - кількість їхніх входжень
unique_counts = {x: lst_1.count(x) for x in set(lst_1)}
# Виводимо результат
print("b) Словник із кількістю входжень кожного унікального числа:", unique_counts)

# c) Вивести вміст словника у відсортованому за зростанням ключів вигляді
# Сортуємо словник за ключами у відсортованому порядку
sorted_counts = dict(sorted(unique_counts.items()))
# Виводимо результат
print("c) Вміст словника у відсортованому за зростанням ключів вигляді:", sorted_counts)

# d) Знайти три ключі з найбільшими значеннями у словнику
# Сортуємо ключі словника за їхніми значеннями у зворотному порядку і обираємо перші три
top_3_keys = sorted(unique_counts, key=unique_counts.get, reverse=True)[:3]
# Виводимо результат
print("d) Три ключі з найбільшими значеннями у словнику:", top_3_keys)

