# Заданий список list_2
list_2 = [-7, 0, 7, 3, -1, 0, 3, 7, -6, 5]
print("Заданий список list_2:", list_2)

# Сформуємо список list_3, що складається з елементів списку list_2 та елементів рядку "A b Bd 12a057cdF#"
list_3 = list_2 + ['A', 'b', 'Bd', '12a057cdF#']
print("Сформований список list_3:", list_3)

# Додамо символ "@" в кінець списку
list_3.append('@')
print("Список після додавання '@' в кінець:", list_3)

# Видалимо 3-й та останній елементи списку
del list_3[2]
del list_3[-1]
print("Список після видалення 3-го та останнього елементів:", list_3)

# Знайдемо кількість входжень елементу 0 та його індекси
count_zero = list_3.count(0)
index_zero = [i for i, x in enumerate(list_3) if x == 0]
print("Кількість входжень елементу 0:", count_zero)
print("Індекси входжень елементу 0:", index_zero)

# Перетворимо список list_3 на рядок із розподільником ", "
list_3_as_string = ", ".join(map(str, list_3))
print("Список list_3 у вигляді рядка з розподільником \", \":", list_3_as_string)
