str_1 = "Remember that the most dangerous prison is the one in your head"
str_2 = "the"

# a) Розбиваємо рядок на слова за допомогою методу split()
words = str_1.split()  # Розбиваємо рядок на окремі слова
print("Слова у рядку str_1:", words)  # Виводимо список слів

# b) Підраховуємо кількість входжень підстроки str_2 за допомогою методу count()
occurrences = str_1.count(str_2)  # Підраховуємо кількість входжень підстроки 'the'
print(f"Кількість входжень '{str_2}' у рядку str_1: {occurrences}")  # Виводимо кількість входжень

# c) Міняємо місцями 2-ге та останнє слово, використовуючи зрізи та зворотнє індексування
words[1], words[-1] = words[-1], words[1]  # Міняємо місцями 2-ге та останнє слово
print("Рядок після заміни місцями 2-го та останнього слова:", ' '.join(words))  # Виводимо змінений рядок

# d) Знаходимо найдовше слово та його кількість літер
longest_word = max(words, key=len)  # Знаходимо найдовше слово
print(f"Найдовше слово у рядку: '{longest_word}', кількість літер: {len(longest_word)}")  # Виводимо найдовше слово та його довжину
