# Створення списку з вказаними елементами
lst_1 = [5, 4, 3, 8, 2, 9, 6, 9, 1, 5, 4, 1, 2, 5, 7, 1, 3, 7, 5, 9, 3]

# Додавання нового елементу зі значенням 10 на місце з індексом 2 у списку lst_1
lst_1.insert(2, 10)
print("Список після додавання елементу на місце з індексом 2:", lst_1)

# Переміщення елементів списку по колу праворуч, видаляючи останній елемент, а потім додаючи його назад у початок списку
last_element = lst_1.pop()
lst_1 = lst_1[1:] + [last_element]
print("Список після переміщення елементів по колу праворуч:", lst_1)

# Знаходження індексу першого входження елементу зі значенням 5 у списку lst_1 і виведення його на екран
index_of_five = lst_1.index(5)
print("Індекс першого входження елементу 5:", index_of_five)

