str_1 = 'Remember that the most dangerous prison is the one in your head'

# a) Знаходимо довжину рядка
length = len(str_1)  # Використовуємо функцію len(), щоб отримати кількість символів у рядку str_1
print(f"Довжина рядка: {length}")  # Виводимо довжину рядка

# b) Визначаємо індекси першого та останнього входження літери ‘w’ у рядку
first_index_w = str_1.find('w')  # Використовуємо метод find() для знаходження індексу першого входження 'w'
last_index_w = str_1.rfind('w')  # Використовуємо метод rfind() для знаходження індексу останнього входження 'w'
print(f"Індекс першого входження 'w': {first_index_w}")  # Виводимо індекс першого входження 'w'
print(f"Індекс останнього входження 'w': {last_index_w}")  # Виводимо індекс останнього входження 'w'

# c) Змінюємо прописні літери на заголовні (капіталізуємо першу літеру кожного слова)
title_str = str_1.title()  # Використовуємо метод title() для зміни першої літери кожного слова на велику
print(f"Рядок зі заголовними літерами: {title_str}")  # Виводимо новий рядок зі зміненими заголовними літерами

# d) Знаходимо символ пробілу та замінюємо на *
replaced_str = str_1.replace(' ', '*')  # Використовуємо метод replace() для заміни всіх пробілів на '*'
print(f"Рядок з заміною пробілів на '*': {replaced_str}")  # Виводимо новий рядок зі заміненими пробілами
