import math  # Імпортуємо модуль math для виконання математичних операцій

a = 5
b = 42.18
c = 305

# a)
# Додаємо a і b, округлюємо результат до 2 знаків після коми
print(f"a + b = {a + b:.2f}")

# Множимо a на b, округлюємо результат до 2 знаків після коми
print(f"a * b = {a * b:.2f}")

# Обчислюємо залишок від ділення c на a
print(f"c % a = {c % a}")

# Обчислюємо a в степені цілого числа від ділення c на a
print(f"a ** (c // a) = {a ** (c // a)}")

# b)
# Обчислюємо натуральний логарифм від b, округлюємо до 2 знаків після коми
print(f"ln(b) = {math.log(b):.2f}")

# Обчислюємо косинус від a (значення a в радіанах), округлюємо до 2 знаків після коми
print(f"cos(a) = {math.cos(a):.2f}")

# Обчислюємо арккосинус від залишку c % a і беремо абсолютне значення, округлюємо до 2 знаків після коми
print(f"abs(arccos(c % a)) = {abs(math.acos(c % a)):.2f}")

# Обчислюємо експоненту від a, округлюємо до 2 знаків після коми
print(f"exp(a) = {math.exp(a):.2f}")

# c)
# Об'єднуємо значення a і c в одне число шляхом конкатенації рядків
ac = int(str(a) + str(c))

# Обчислюємо суму цифр числа ac, ігноруючи нулі
sum_digits = sum(int(digit) for digit in str(ac) if int(digit) != 0)

# Обчислюємо добуток цифр числа ac, ігноруючи нулі
product_digits = math.prod(int(digit) for digit in str(ac) if int(digit) != 0)

# Виводимо результат суми цифр числа ac
print(f"Сума цифр числа {ac} = {sum_digits}")

# Виводимо результат добутку цифр числа ac
print(f"Добуток цифр числа {ac} = {product_digits}")
