# Задані списки
lst_1 = [5, 4, 3, 8, 2, 9, 6, 9, 1, 5, 4, 1, 2, 5, 7, 1, 3, 7, 5, 9, 3]  # Створення списку lst_1
lst_2 = [-7, 24, 9, -1, 5, 6, -56, -18, 5, 5]  # Створення списку lst_2

# a) Виведення елементів з 8-го по передостанній списку lst_1
print("Елементи з 8-го по передостанній у списку lst_1:", lst_1[8:-1])

# b) Знаходження індексів та значень максимального та мінімального елементів у lst_2
max_value = max(lst_2)  # Знаходження максимального значення у списку lst_2
min_value = min(lst_2)  # Знаходження мінімального значення у списку lst_2
max_index = lst_2.index(max_value)  # Знаходження індексу максимального значення у списку lst_2
min_index = lst_2.index(min_value)  # Знаходження індексу мінімального значення у списку lst_2
print("Максимальний елемент у lst_2:", max_value, "з індексом", max_index)
print("Мінімальний елемент у lst_2:", min_value, "з індексом", min_index)

# c) Створення списку lst_2_5, елементи якого більше 5 за модулем
lst_2_5 = [x for x in lst_2 if abs(x) > 5]  # Створення списку lst_2_5 за умовою
print("Список lst_2_5:", lst_2_5)

# d) Створення нового списку lst_new, що складається з елементів lst_1 та lst_2, спільних для цих двох списків (без дублікатів)
lst_new = list(set(lst_1) & set(lst_2))  # Створення списку lst_new за допомогою перетину множин
print("Список lst_new:", lst_new)
